khoitd1997/qt_signal_analyzer/firmware/nrf52832/examples/ble_peripheral/ble_app_hrs/main.cpp
/**
 * Copyright (c) 2014 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/** @file
 *
 * @defgroup ble_sdk_app_template_main main.c
 * @{
 * @ingroup ble_sdk_app_template
 * @brief Template project main file.
 *
 * This file contains a template for creating a new application. It has the code necessary to wakeup
 * from button, advertise, get a connection restart advertising on disconnect and if no new
 * connection created go back to system-off mode.
 * It can easily be used as a starting point for creating a new application, the comments identified
 * with 'YOUR_JOB' indicates where and how you can customize.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "app_error.h"
#include "app_timer.h"

#include "ble.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_conn_state.h"
#include "ble_hci.h"
#include "ble_srv_common.h"

#include "bsp_btn_ble.h"

#include "fds.h"
#include "nordic_common.h"

#include "nrf.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_pwr_mgmt.h"

#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

#include "peer_manager.h"
#include "peer_manager_handler.h"
#include "sensorsim.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "nrf_bsp.hpp"
#include "nrf_power.hpp"
#include "nrf_timer.hpp"

#define DEVICE_NAME "Signal_Analyzer"
#define MANUFACTURER_NAME "KhoiTrinh"
#define APP_ADV_INTERVAL 300

#define APP_ADV_DURATION \
  18000 /**< The advertising duration (180 seconds) in units of 10 milliseconds. */
#define APP_BLE_OBSERVER_PRIO \
  3 /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG 1 /**< A tag identifying the SoftDevice BLE configuration. */

#define MIN_CONN_INTERVAL \
  MSEC_TO_UNITS(100, UNIT_1_25_MS) /**< Minimum acceptable connection interval (0.1 seconds). */
#define MAX_CONN_INTERVAL \
  MSEC_TO_UNITS(200, UNIT_1_25_MS) /**< Maximum acceptable connection interval (0.2 second). */
#define SLAVE_LATENCY 0            /**< Slave latency. */
#define CONN_SUP_TIMEOUT \
  MSEC_TO_UNITS(4000, UNIT_10_MS) /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY                                                            \
  APP_TIMER_TICKS(                                                                                \
      5000) /**< Time from initiating event (connect or start of notification) to \ \ \ \ \ \ \ \ \
               \ \ \ \ \ \ \                                                          \ \ \ \ \ \ \
               \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \                                                                                                \
               \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \                                                                                                \
               \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \                                                                                                \
               \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \                                                                                                \
               \ \ \ \ \ \ \ \ \ first time sd_ble_gap_conn_param_update is called (5 \ \ \ \ \ \ \
               \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY                                                              \
  APP_TIMER_TICKS(30000) /**< Time between each call to sd_ble_gap_conn_param_update after the \ \ \
                            \ \ \ \ \ \ \                                                          \
                            \ \ \ \ \ \ \ \ \                                                                                     \
                            \ \ \ \ \ \ \ \ \ \                                                                                                 \
                            \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \  \
                            \ \ \ \ \ \ \ \ \ first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT \
  3 /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND 1     /**< Perform bonding. */
#define SEC_PARAM_MITM 0     /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC 0     /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS 0 /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES BLE_GAP_IO_CAPS_NONE /**< No I/O capabilities. */
#define SEC_PARAM_OOB 0                                /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE 7                       /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE 16                      /**< Maximum encryption key size. */

#define DEAD_BEEF                                                                                  \
  0xDEADBEEF /**< Value used as error code on stack dump, can be used to identify stack location \ \
                \                                                                                  \
                \ \                                                                                                 \
                \ \ \                                                                                                 \
                \ \ \ \                                                                                                 \
                \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \ \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ on stack unwind. \ \
                \                                                                                  \
                \ \                                                                                                 \
                \ \ \                                                                                                 \
                \ \ \ \                                                                                                 \
                \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \ \ \ \ \                                                                                                 \
                \ \ \ \ \ \ \ \ \ \ \ \                                                                                                 \
              */

NRF_BLE_GATT_DEF(m_gatt);           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising); /**< Advertising module instance. */

